# Custom sentence splitter for Arabic text
ar_custom_sentence_splitter = [
    " و ", " ثم ", " بعدها ", " لكن ", " لأن ", " لذلك ", ".", "؟", "!", "\n", " أو ", " ف ", " إذن ", " إذا ",
    " حيث ", " حين ", " حتى ", " بينما ", " عندما ", " منذ ", " حينما ", " طالما ", " كلما ", " بما أن ", " بسبب ",
    " من أجل ", " مع ", " على الرغم من ", " إلا أن ", " بعد أن ", " قبل أن ", " كذلك ", "؛", "،", "...", " لأنّ ",
    " بالرغم من ", " بالإضافة إلى ", " مثلما ", " كما أنّ ", " كذلك فإنّ ", " حتى ولو ", " غير أنّ ", " بحيث ",
    " حتى إذا ", " حتى لو ", " بيد أنّ ", " لا سيما ", " ذلك أن ", " بمعنى آخر ", " بناءً على ", " من ناحية أخرى ",
    " إلى أن ", " لهذا السبب "
]
